Autodesk.Revit.UI.SiteLinkerUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.SiteLinkerUIData.LevelId
TopographyLink member element level id.
Since:
2019

Autodesk.Revit.UI.SiteLinkerUIData.ElemTypeId
TopographyLink member element type id.
Since:
2019

Autodesk.Revit.UI.SiteLinkerUIData.FilePath
The path of file to link.
Since:
2019

Autodesk.Revit.UI.SiteLinkerUIData
The data associated with the site insert service.
Since:
2019